4Alisa/11/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суммма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

4Alisa/11/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/11/Documents/ПродажаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СписокТоваровТоварПриИзмененииНаСервере(ДанныеВыбора, ИДСтроки = 0)
	// Вставить содержимое обработчика.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
	                      |	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, Товар = &Товар) КАК ОстаткиТоваровОстатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СрокГодности");
	
	Если (ИДСтроки = Неопределено ИЛИ ИДСтроки = NULL) Тогда
		Возврат;
	КонецЕсли;
	
	Товар = ?(Объект.СписокТоваров.Количество() > ИДСтроки И ИДСтроки >=0 , Объект.СписокТоваров[ИДСтроки].Товар.Ссылка,Справочники.Товары.ПустаяСсылка());
	Если Товар = Справочники.Товары.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Объект.Дата);
	Запрос.УстановитьПараметр("Товар", 	Товар );
	РЗапроса = Запрос.Выполнить(); ВЗапроса = РЗапроса.Выбрать();
	ДанныеВыбора.Очистить(); 
	Пока ВЗапроса.Следующий() Цикл
		ДанныеВыбора.Добавить(ВЗапроса.СрокГодности);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ДанныеВыбора = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора;
	ИДСтроки = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваров.ТекущаяСтрока;

	СписокТоваровТоварПриИзмененииНаСервере(ДанныеВыбора, ИДСтроки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТДанныеВыбора = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора;
	ИДСтроки = ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваров.ТекущаяСтрока;
	СписокТоваровТоварПриИзмененииНаСервере(ТДанныеВыбора, ИДСтроки);
	ЭтотОбъект.ЭтаФорма.Элементы.СписокТоваровСрокГодности.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора.ВыгрузитьЗначения());	
КонецПроцедуры
